 # coding=utf8
import pymongo as pm 
import re
import pandas as pd
import json
from turfpy.measurement import boolean_point_in_polygon
from geojson import Point, Polygon, Feature



client = pm.MongoClient()
db = client['twitterdb']
#print(db.collection_names())
collection = db['twitter_search']
data = collection.find()
#print(data[0]['text'])

def trnsProvince(Province):
    if Province in Bangkok:
        Province = 'Bangkok'
    elif Province in Krabi:
        Province = 'Krabi'
    elif Province in Kanchanaburi:
        Province = 'Kanchanaburi'
    elif Province in Kalasin:
        Province = 'Kalasin'
    elif Province in Kamphaeng_Phet:
        Province = 'Kamphaeng Phet'
    elif Province in Chanthaburi:
        Province = 'Chanthaburi'
    elif Province in Chachoengsao:
        Province = 'Chachoengsao'
    elif Province in Chonburi:
        Province = 'Chonburi'
    elif Province in Chainat:
        Province = 'Chainat'
    elif Province in Chaiyaphum:
        Province = 'Chaiyaphum'
    elif Province in Chumphon:
        Province = 'Chumphon'
    elif Province in Chiang_Rai:
        Province = 'Chiang Rai'
    elif Province in Chiang_Mai:
        Province = 'Chiang Mai'
    elif Province in Trang:
        Province = 'Trang'
    elif Province in Trat:
        Province = 'Trat'
    elif Province in Tak:
        Province = 'Tak'
    elif Province in Nakhon_Nayok:
        Province = 'Nakhon_Nayok'
    elif Province in Nakhon_Pathom:
        Province = 'Nakhon Pathom'
    elif Province in Nakhon_Phanom:
        Province = 'Nakhon Phanom'
    elif Province in Nakhon_Ratchasima:
        Province = 'Nakhon Ratchasima'
    elif Province in Nakhon_Si_Thammarat:
        Province = 'Nakhon_Si_Thammarat'
    elif Province in Nakhon_Sawan:
        Province = 'Nakhon Sawan'
    elif Province in Nonthaburi:
        Province = 'Nonthaburi'
    elif Province in Narathiwat:
        Province = 'Narathiwat'
    elif Province in Nan:
        Province = 'Nan'
    elif Province in Bueng_Kan:
        Province = 'Bueng Kan'
    elif Province in Buriram:
        Province = 'Buriram'
    elif Province in Pathum_Thani:
        Province = 'Pathum Thani'
    elif Province in Prachuap_Khiri_Khan:
        Province = 'Prachuap Khiri Khan'
    elif Province in Prachinburi:
        Province = 'Prachinburi'
    elif Province in Pattani:
        Province = 'Pattani'
    elif Province in Phra_Nakhon_Si_Ayutthaya:
        Province = 'Phra Nakhon Si Ayutthaya'
    elif Province in Phayao:
        Province = 'Phayao'
    elif Province in Phang_Nga:
        Province = 'Phang Nga'
    elif Province in Phatthalung:
        Province = 'Phatthalung'
    elif Province in Phichit:
        Province = 'Phichit'
    elif Province in Phitsanulok:
        Province = 'Phitsanulok'
    elif Province in Phetchaburi:
        Province = 'Phetchaburi'
    elif Province in Phetchabun:
        Province = 'Phetchabun'
    elif Province in Phrae:
        Province = 'Phrae'
    elif Province in Phuket:
        Province = 'Phuket'
    elif Province in Maha_Sarakham:
        Province = 'Maha Sarakham'
    elif Province in Mukdahan:
        Province = 'Mukdahan'
    elif Province in Mae_Hong_Son:
        Province = 'Mae Hong Son'
    elif Province in Yasothon:
        Province = 'Yasothon'
    elif Province in Yala:
        Province = 'Yala'
    elif Province in Roi_Et:
        Province = 'Roi_Et'
    elif Province in Ranong:
        Province = 'Ranong'
    elif Province in Rayong:
        Province = 'Rayong'
    elif Province in Ratchaburi:
        Province = 'Ratchaburi'
    elif Province in Lopburi:
        Province = 'Lopburi'
    elif Province in Lampang:
        Province = 'Lampang'
    elif Province in Lamphun:
        Province = 'Lamphun'
    elif Province in Loei:
        Province = 'Loei'
    elif Province in Sisaket:
        Province = 'Sisaket'
    elif Province in Sakon_Nakhon:
        Province = 'Sakon Nakhon'
    elif Province in Songkhla:
        Province = 'Songkhla'
    elif Province in Satun:
        Province = 'Satun'
    elif Province in Samut_Prakan:
        Province = 'Samut Prakan'
    elif Province in Samut_Songkhram:
        Province = 'Samut Songkhram'
    elif Province in Samut_Sakhon:
        Province = 'Samut Sakhon'
    elif Province in Sa_Kaeo:
        Province = 'Sa Kaeo'
    elif Province in Sing_Buri:
        Province = 'Sing_Buri'
    elif Province in Sukhothai:
        Province = 'Sukhothai'
    elif Province in Suphan_Buri:
        Province = 'Suphan Buri'
    elif Province in Surat_Thani:
        Province = 'Surat Thani'
    elif Province in Surin:
        Province = 'Surin'
    elif Province in Nong_Khai:
        Province = 'Nong Khai'
    elif Province in Nong_Bua_Lamphu:
        Province = 'Nong Bua Lamphu'
    elif Province in Ang_Thong:
        Province = 'Ang Thong'
    elif Province in Amnat_Charoen:
        Province = 'Amnat_Charoen'
    elif Province in Udon_Thani:
        Province = 'Udon Thani'
    elif Province in Uttaradit:
        Province = 'Uttaradit'
    elif Province in Uthai_Thani:
        Province = 'Uthai Thani'
    elif Province in Ubon_Ratchathani:
        Province = 'Ubon Ratchathani'
    else : Province = 'unknow'
    return Province



Bangkok = {"พระนคร" ,"ดุสิต" ,"หนองจอก" ,"บางรัก" ,"บางเขน" ,"บางกะปิ" ,"ปทุมวัน" ,"ป้อมปราบศัตรูพ่าย" ,"พระโขนง" ,"มีนบุรี" ,"ลาดกระบัง" ,"ยานนาวา" ,"สัมพันธวงศ์" ,"พญาไท" ,"ธนบุรี" ,"บางกอกใหญ่" ,"ห้วยขวาง" ,"คลองสาน" ,"ตลิ่งชัน" ,"บางกอกน้อย" ,"บางขุนเทียน" ,"ภาษีเจริญ" ,"หนองแขม" ,"ราษฎร์บูรณะ" ,"บางพลัด" ,"ดินแดง" ,"บึงกุ่ม" ,"สาทร" ,"บางซื่อ" ,"จตุจักร" ,"บางคอแหลม" ,"ประเวศ" ,"คลองเตย" ,"สวนหลวง" ,"จอมทอง" ,"ดอนเมือง" ,"ราชเทวี" ,"ลาดพร้าว" ,"วัฒนา" ,"บางแค" ,"หลักสี่" ,"สายไหม" ,"คันนายาว" ,"สะพานสูง" ,"วังทองหลาง" ,"คลองสามวา" ,"บางนา" ,"ทวีวัฒนา" ,"ทุ่งครุ" ,"บางบอน"}
Krabi = {"อ.เกาะลันตา", "อ.เขาพนม", "อ.คลองท่อม", "อ.ปลายพระยา", "อ.เมืองกระบี่", "อ.ลำทับ", "อ.เหนือคลอง", "อ.อ่าวลึก"}
Kanchanaburi = {"อ.ด่านมะขามเตี้ย", "อ.ทองผาภูมิ", "อ.ท่าม่วง", "อ.ท่ามะกา", "อ.ไทรโยค", "อ.บ่อพลอย", "อ.พนมทวน", "อ.เมืองกาญจนบุรี", "อ.เลาขวัญ", "อ.ศรีสวัสดิ์", "อ.สังขละบุรี", "อ.หนองปรือ", "อ.ห้วยกระเจา"}
Kalasin = {"อ.กมลาไสย", "อ.กุฉินารายณ์", "อ.เขาวง", "อ.คำม่วง", "อ.ฆ้องชัย", "อ.ดอนจาน", "อ.ท่าคันโท", "อ.นาคู", "อ.นามน", "อ.เมืองกาฬสินธุ์", "อ.ยางตลาด", "อ.ร่องคำ", "อ.สมเด็จ", "อ.สหัสขันธ์", "อ.สามชัย", "อ.หนองกุงศรี", "อ.ห้วยผึ้ง", "อ.ห้วยเม็ก"}
Kamphaeng_Phet = {"อ.โกสัมพีนคร", "อ.ขาณุวรลักษบุรี", "อ.คลองขลุง", "อ.คลองลาน", "อ.ทรายทองวัฒนา", "อ.ไทรงาม", "อ.บึงสามัคคี", "อ.ปางศิลาทอง", "อ.พรานกระต่าย", "อ.เมืองกำแพงเพชร", "อ.ลานกระบือ"}
Khon_Kaen = {"อ.กระนวน", "อ.เขาสวนกวาง", "อ.โคกโพธิ์ไชย", "อ.ชนบท", "อ.ชุมแพ", "อ.ซำสูง", "อ.น้ำพอง", "อ.โนนศิลา", "อ.บ้านไผ่", "อ.บ้านฝาง", "อ.บ้านแฮด", "อ.เปือยน้อย", "อ.พระยืน", "อ.พล", "อ.ภูผาม่าน", "อ.ภูเวียง", "อ.มัญจาคีรี", "อ.เมืองขอนแก่น", "อ.เวียงเก่า", "อ.แวงน้อย", "อ.แวงใหญ่", "อ.สีชมพู", "อ.หนองนาคำ", "อ.หนองเรือ", "อ.หนองสองห้อง", "อ.อุบลรัตน์"}
Chanthaburi = {"อ.แก่งหางแมว", "อ.ขลุง", "อ.เขาคิชฌกูฏ", "อ.ท่าใหม่", "อ.นายายอาม", "อ.โป่งน้ำร้อน", "อ.มะขาม", "อ.เมืองจันทบุรี", "อ.สอยดาว", "อ.แหลมสิงห์"}
Chachoengsao = {"อ.คลองเขื่อน" ,"อ.ท่าตะเกียบ" ,"อ.บางคล้า" ,"อ.บางน้ำเปรี้ยว" ,"อ.บางปะกง" ,"อ.บ้านโพธิ์" ,"อ.แปลงยาว" ,"อ.พนมสารคาม" ,"อ.เมืองฉะเชิงเทรา" ,"อ.ราชสาส์น" ,"อ.สนามชัยเขต"}
Chonburi = {"อ.เกาะจันทร์", "อ.เกาะสีชัง", "อ.บ่อทอง", "อ.บางละมุง", "อ.บ้านบึง", "อ.พนัสนิคม", "อ.พานทอง", "อ.เมืองชลบุรี", "อ.ศรีราชา", "อ.สัตหีบ", "อ.หนองใหญ่"}
Chainat = {"อ.เนินขาม", "อ.มโนรมย์", "อ.เมืองชัยนาท", "อ.วัดสิงห์", "อ.สรรคบุรี", "อ.สรรพยา", "อ.หนองมะโมง", "อ.หันคา"}
Chaiyaphum = {"อ.เกษตรสมบูรณ์", "อ.แก้งคร้อ", "อ.คอนสวรรค์", "อ.คอนสาร", "อ.จัตุรัส", "อ.ซับใหญ่", "อ.เทพสถิต", "อ.เนินสง่า", "อ.บ้านเขว้า", "อ.บ้านแท่น", "อ.บำเหน็จณรงค์", "อ.ภักดีชุมพล", "อ.ภูเขียว", "อ.เมืองชัยภูมิ", "อ.หนองบัวแดง", "อ.หนองบัวระเหว"}
Chumphon = {"อ.ท่าแซะ", "อ.ทุ่งตะโก", "อ.ปะทิว", "อ.พะโต๊ะ", "อ.เมืองชุมพร", "อ.ละแม", "อ.สวี", "อ.หลังสวน"}
Chiang_Rai = {"อ.ขุนตาล" ,"อ.เชียงของ", "อ.เชียงแสน" ,"อ.ดอยหลวง" ,"อ.เทิง" ,"อ.ป่าแดด" ,"อ.พญาเม็งราย" ,"อ.พาน" ,"อ.เมืองเชียงราย" ,"อ.แม่จัน" ,"อ.แม่ฟ้าหลวง" ,"อ.แม่ลาว" ,"อ.แม่สรวย" ,"อ.แม่สาย" ,"อ.เวียงแก่น" ,"อ.เวียงชัย" ,"อ.เวียงเชียงรุ้ง" ,"อ.เวียงป่าเป้า"}
Chiang_Mai = {"อ.กัลยาณิวัฒนา", "อ.จอมทอง", "อ.เชียงดาว", "อ.ไชยปราการ", "อ.ดอยเต่า", "อ.ดอยสะเก็ด", "อ.ดอยหล่อ", "อ.ฝาง", "อ.พร้าว", "อ.เมืองเชียงใหม่", "อ.แม่แจ่ม", "อ.แม่แตง", "อ.แม่ริม", "อ.แม่วาง", "อ.แม่ออน", "อ.แม่อาย", "อ.เวียงแหง", "อ.สะเมิง", "อ.สันกำแพง", "อ.สันทราย", "อ.สันป่าตอง", "อ.สารภี", "อ.หางดง", "อ.อมก๋อย", "อ.ฮอด"}
Trang = {"อ.กันตัง" ,"อ.นาโยง" ,"อ.ปะเหลียน" ,"อ.เมืองตรัง" ,"อ.ย่านตาขาว", "อ.รัษฎา" ,"อ.วังวิเศษ" ,"อ.สิเกา" ,"อ.ห้วยยอด" ,"อ.หาดสำราญ"}
Trat = {"อ.เกาะกูด", "อ.เกาะช้าง", "อ.เขาสมิง", "อ.คลองใหญ่", "อ.บ่อไร่", "อ.เมืองตราด", "อ.แหลมงอบ"}
Tak = {"อ.ท่าสองยาง" , "อ.บ้านตาก" , "อ.พบพระ" , "อ.เมืองตาก" , "อ.แม่ระมาด" , "อ.แม่สอด" , "อ.วังเจ้า" , "อ.สามเงา" , "อ.อุ้มผาง"}
Nakhon_Nayok = {"อ.บ้านนา", "อ.ปากพลี", "อ.เมืองนครนายก", "อ.องครักษ์"}
Nakhon_Pathom = {"อ.กำแพงแสน" ,"อ.ดอนตูม" ,"อ.นครชัยศรี" ,"อ.บางเลน" ,"อ.พุทธมณฑล" ,"อ.เมืองนครปฐม" ,"อ.สามพราน"}
Nakhon_Phanom = {"อ.ท่าอุเทน", "อ.ธาตุพนม", "อ.นาแก", "อ.นาทม", "อ.นาหว้า", "อ.บ้านแพง", "อ.ปลาปาก", "อ.โพนสวรรค์", "อ.เมืองนครพนม", "อ.เรณูนคร", "อ.วังยาง", "อ.ศรีสงคราม"}
Nakhon_Ratchasima = {"อ.แก้งสนามนาง", "อ.ขามทะเลสอ", "อ.ขามสะแกแสง", "อ.คง", "อ.ครบุรี", "อ.จักราช", "อ.เฉลิมพระเกียรติ", "อ.ชุมพวง", "อ.โชคชัย", "อ.ด่านขุนทด", "อ.เทพารักษ์", "อ.โนนแดง", "อ.โนนไทย", "อ.โนนสูง", "อ.บัวลาย", "อ.บัวใหญ่", "อ.บ้านเหลื่อม", "อ.ประทาย", "อ.ปักธงชัย", "อ.ปากช่อง", "อ.พระทองคำ", "อ.พิมาย", "อ.เมืองนครราสีมา", "อ.เมืองยาง", "อ.ลำทะเมนชัย", "อ.วังน้ำเขียว", "อ.สีคิ้ว", "อ.สีดา", "อ.สูงเนิน", "อ.เสิงสาง", "อ.หนองบุญมาก", "อ.ห้วยแถลง"}
Nakhon_Si_Thammarat = {"อ.ขนอม", "อ.จุฬาภรณ์", "อ.ฉวาง", "อ.เฉลิมพระเกียรติ", "อ.ชะอวด", "อ.ช้างกลาง", "อ.เชียรใหญ่", "อ.ถ้ำพรรณรา", "อ.ท่าศาลา", "อ.ทุ่งสง", "อ.ทุ่งใหญ่", "อ.นบพิตำ", "อ.นาบอน", "อ.บางขัน", "อ.ปากพนัง", "อ.พรหมคีรี", "อ.พระพรหม", "อ.พิปูน", "อ.เมืองนครศรีธรรมราช", "อ.ร่อนพิบูลย์", "อ.ลานสกา", "อ.สิชล", "อ.หัวไทร"}
Nakhon_Sawan = {"อ.เก้าเลี้ยว", "อ.โกรกพระ", "อ.ชุมตาบง", "อ.ชุมแสง", "อ.ตากฟ้า", "อ.ตาคลี", "อ.ท่าตะโก", "อ.บรรพตพิสัย", "อ.พยุหะคีรี", "อ.ไพศาลี", "อ.เมืองนครสวรรค์", "อ.แม่เปิน", "อ.แม่วงก์", "อ.ลาดยาว", "อ.หนองบัว"}
Nonthaburi = {"อ.ไทรน้อย", "อ.บางกรวย", "อ.บางบัวทอง", "อ.บางใหญ่", "อ.ปากเกร็ด", "อ.เมืองนนทบุรี"}
Narathiwat = {"อ.จะแนะ", "อ.เจาะไอร้อง", "อ.ตากใบ", "อ.บาเจาะ", "อ.เมืองนราธิวาส", "อ.ยี่งอ", "อ.ระแงะ", "อ.รือเสาะ", "อ.แว้ง", "อ.ศรีสาคร", "อ.สุคิริน", "อ.สุไหงโก-ลก", "อ.สุไหงปาดี"}
Nan = {"อ.เฉลิมพระเกียรติ", "อ.เชียงกลาง", "อ.ท่าวังผา", "อ.ทุ่งช้าง", "อ.นาน้อย", "อ.นาหมื่น", "อ.บ่อเกลือ", "อ.บ้านหลวง", "อ.ปัว", "อ.ภูเพียง", "อ.เมืองน่าน", "อ.แม่จริม", "อ.เวียงสา", "อ.สองแคว", "อ.สันติสุข"}
Bueng_Kan = {"อ.เซกา", "อ.โซ่พิสัย", "อ.บึงโขงหลง", "อ.บุ่งคล้า", "อ.ปากคาด", "อ.พรเจริญ", "อ.เมืองบึงกาฬ", "อ.ศรีวิไล"}
Buriram = {"อ.กระสัง", "อ.คูเมือง", "อ.แคนดง", "อ.เฉลิมพระเกียรติ", "อ.ชำนิ", "อ.นางรอง", "อ.นาโพธิ์", "อ.โนนดินแดง", "อ.โนนสุวรรณ", "อ.บ้านกรวด", "อ.บ้านด่าน", "อ.บ้านใหม่ไชยพจน์", "อ.ประโคนชัย", "อ.ปะคำ", "อ.พลับพลาชัย", "อ.พุทไธสง", "อ.เมืองบุรีรัมย์", "อ.ละหานทราย", "อ.ลำปลายมาศ", "อ.สตึก", "อ.หนองกี่", "อ.หนองหงส์", "อ.ห้วยราช"}
Pathum_Thani = {"อ.คลองหลวง", "อ.ธัญบุรี", "อ.เมืองปทุมธานี", "อ.ลาดหลุมแก้ว", "อ.ลำลูกกา", "อ.สามโคก", "อ.หนองเสือ"}
Prachuap_Khiri_Khan = {"อ.กุยบุรี", "อ.ทับสะแก", "อ.บางสะพาน", "อ.บางสะพานน้อย", "อ.ปราณบุรี", "อ.เมืองประจวบคีรีขันธ์", "อ.สามร้อยยอด", "อ.หัวหิน"}
Prachinburi = {"อ.กบินทร์บุรี", "อ.นาดี", "อ.บ้านสร้าง", "อ.ประจันตคาม", "อ.เมืองปราจีนบุรี", "อ.ศรีมหาโพธิ", "อ.ศรีมโหสถ"}
Pattani = {"อ.กะพ้อ", "อ.โคกโพธิ์", "อ.ทุ่งยางแดง", "อ.ปะนาเระ", "อ.มายอ", "อ.เมืองปัตตานี", "อ.แม่ลาน", "อ.ไม้แก่น", "อ.ยะรัง", "อ.ยะหริ่ง", "อ.สายบุรี", "อ.หนองจิก"}
Phra_Nakhon_Si_Ayutthaya = {"อ.ท่าเรือ", "อ.นครหลวง", "อ.บางซ้าย", "อ.บางไทร", "อ.บางบาล", "อ.บางปะหัน", "อ.บางปะอิน", "อ.บ้านแพรก", "อ.ผักไห่", "อ.พระนครศรีอยุธยา", "อ.ภาชี", "อ.มหาราช", "อ.ลาดบัวหลวง", "อ.วังน้อย", "อ.เสนา", "อ.อุทัย"}
Phayao = {"อ.จุน", "อ.เชียงคำ", "อ.เชียงม่วน", "อ.ดอกคำใต้", "อ.ปง", "อ.ภูกามยาว", "อ.ภูซาง", "อ.เมืองพะเยา", "อ.แม่ใจ"}
Phang_Nga = {"อ.กะปง", "อ.เกาะยาว", "อ.คุระบุรี", "อ.ตะกั่วทุ่ง", "อ.ตะกั่วป่า", "อ.ทับปุด", "อ.ท้ายเหมือง", "อ.เมืองพังงา"}
Phatthalung = {"อ.กงหรา", "อ.เขาชัยสน", "อ.ควนขนุน", "อ.ตะโหมด", "อ.บางแก้ว", "อ.ปากพะยูน", "อ.ป่าบอน", "อ.ป่าพะยอม", "อ.เมืองพัทลุง", "อ.ศรีนครินทร์", "อ.ศรีบรรพต"}
Phichit = {"อ.ดงเจริญ", "อ.ตะพานหิน", "อ.ทับคล้อ", "อ.บางมูลนาก", "อ.บึงนาราง", "อ.โพทะเล", "อ.โพธิ์ประทับช้าง", "อ.เมืองพิจิตร", "อ.วชิรบารมี", "อ.วังทรายพูน", "อ.สากเหล็ก", "อ.สามง่าม"}
Phitsanulok = {"อ.ชาติตระการ", "อ.นครไทย", "อ.เนินมะปราง", "อ.บางกระทุ่ม", "อ.บางระกำ", "อ.พรหมพิราม", "อ.เมืองพิษณุโลก", "อ.วังทอง", "อ.วัดโบสถ์"}
Phetchaburi = {"อ.แก่งกระจาน", "อ.เขาย้อย", "อ.ชะอำ", "อ.ท่ายาง", "อ.บ้านลาด", "อ.บ้านแหลม", "อ.เมืองเพชรบุรี", "อ.หนองหญ้าปล้อง"}
Phetchabun = {"อ.เขาค้อ", "อ.ชนแดน", "อ.น้ำหนาว", "อ.บึงสามพัน", "อ.เมืองเพชรบูรณ์", "อ.วังโป่ง", "อ.วิเชียรบุรี", "อ.ศรีเทพ", "อ.หนองไผ่", "อ.หล่มเก่า", "อ.หล่มสัก"}
Phrae = {"อ.เด่นชัย", "อ.เมืองแพร่", "อ.ร้องกวาง", "อ.ลอง", "อ.วังชิ้น", "อ.สอง", "อ.สูงเม่น", "อ.หนองม่วงไข่"}
Phuket = {"อ.กะทู้", "อ.ถลาง", "อ.เมืองภูเก็ต"}
Maha_Sarakham = {"อ.กันทรวิชัย", "อ.กุดรัง", "อ.แกดำ", "อ.โกสุมพิสัย", "อ.ชื่นชม", "อ.เชียงยืน", "อ.นาเชือก", "อ.นาดูน", "อ.บรบือ", "อ.พยัคฆภูมิพิสัย", "อ.เมืองมหาสารคาม", "อ.ยางสีสุราช", "อ.วาปีปทุม"}
Mukdahan = {"อ.คำชะอี", "อ.ดงหลวง", "อ.ดอนตาล", "อ.นิคมคำสร้อย", "อ.เมืองมุกดาหาร", "อ.หนองสูง", "อ.หว้านใหญ่"}
Mae_Hong_Son = {"อ.ขุนยวม", "อ.ปางมะผ้า", "อ.ปาย", "อ.เมืองแม่ฮ่องสอน", "อ.แม่ลาน้อย", "อ.แม่สะเรียง", "อ.สบเมย"}
Yasothon = {"อ.กุดชุม", "อ.ค้อวัง", "อ.คำเขื่อนแก้ว", "อ.ทรายมูล", "อ.ไทยเจริญ", "อ.ป่าติ้ว", "อ.มหาชนะชัย", "อ.เมืองยโสธร", "อ.เลิงนกทา"}
Yala = {"อ.กรงปินัง", "อ.กาบัง", "อ.ธารโต", "อ.บันนังสตา", "อ.เบตง", "อ.เมืองยะลา", "อ.ยะหา", "อ.รามัน"}
Roi_Et = {"อ.เกษตรวิสัย", "อ.จตุรพักตรพิมาน", "อ.จังหาร", "อ.เชียงขวัญ", "อ.ทุ่งเขาหลวง", "อ.ธวัชบุรี", "อ.ปทุมรัตต์", "อ.พนมไพร", "อ.โพธิ์ชัย", "อ.โพนทราย", "อ.โพนทอง", "อ.เมยวดี", "อ.เมืองร้อยเอ็ด", "อ.เมืองสรวง", "อ.ศรีสมเด็จ", "อ.สุวรรณภูมิ", "อ.เสลภูมิ", "อ.หนองพอก", "อ.หนองฮี", "อ.อาจสามารถ"}
Ranong = {"อ.กระบุรี", "อ.กะเปอร์", "อ.เมืองระนอง", "อ.ละอุ่น", "อ.สุขสำราญ"}
Rayong = {"อ.แกลง", "อ.เขาชะเมา", "อ.นิคมพัฒนา", "อ.บ้านค่าย", "อ.บ้านฉาง", "อ.ปลวกแดง", "อ.เมืองระยอง", "อ.วังจันทร์"}
Ratchaburi = {"อ.จอมบึง", "อ.ดำเนินสะดวก", "อ.บางแพ", "อ.บ้านคา", "อ.บ้านโป่ง", "อ.ปากท่อ", "อ.โพธาราม", "อ.เมืองราชบุรี", "อ.วัดเพลง", "อ.สวนผึ้ง"}
Lopburi = {"อ.โคกเจริญ", "อ.โคกสำโรง", "อ.ชัยบาดาล", "อ.ท่าวุ้ง", "อ.ท่าหลวง", "อ.บ้านหมี่", "อ.พัฒนานิคม", "อ.เมืองลพบุรี", "อ.ลำสนธิ", "อ.สระโบสถ์","อ.หนองม่วง"}
Lampang = {"อ.เกาะคา", "อ.งาว", "อ.แจ้ห่ม", "อ.เถิน", "อ.เมืองปาน", "อ.เมืองลำปาง", "อ.แม่ทะ", "อ.แม่พริก", "อ.แม่เมาะ", "อ.วังเหนือ", "อ.สบปราบ", "อ.เสริมงาม", "อ.ห้างฉัตร"}
Lamphun = {"อ.ทุ่งหัวช้าง", "อ.บ้านธิ", "อ.บ้านโฮ่ง", "อ.ป่าซาง", "อ.เมืองลำพูน", "อ.แม่ทา", "อ.ลี้", "อ.เวียงหนองล่อง"}
Loei = {"อ.เชียงคาน", "อ.ด่านซ้าย", "อ.ท่าลี่", "อ.นาด้วง", "อ.นาแห้ว", "อ.ปากชม", "อ.ผาขาว", "อ.ภูกระดึง", "อ.ภูเรือ", "อ.ภูหลวง", "อ.เมืองเลย", "อ.วังสะพุง", "อ.หนองหิน", "อ.เอราวัณ"}
Sisaket = {"อ.กันทรลักษ์", "อ.กันทรารมย์", "อ.ขุขันธ์", "อ.ขุนหาญ", "อ.น้ำเกลี้ยง", "อ.โนนคูณ", "อ.บึงบูรพ์", "อ.เบญจลักษ์", "อ.ปรางค์กู่", "อ.พยุห์", "อ.โพธิ์ศรีสุวรรณ", "อ.ไพรบึง", "อ.ภูสิงห์", "อ.เมืองจันทร์", "อ.เมืองศรีสะเกษ", "อ.ยางชุมน้อย", "อ.ราษีไศล", "อ.วังหิน", "อ.ศรีรัตนะ", "อ.ศิลาลาด", "อ.ห้วยทับทัน", "อ.อุทุมพรพิสัย"}
Sakon_Nakhon = {"อ.กุดบาก", "อ.กุสุมาลย์", "อ.คำตากล้า", "อ.โคกศรีสุพรรณ", "อ.เจริญศิลป์", "อ.เต่างอย", "อ.นิคมน้ำอูน", "อ.บ้านม่วง", "อ.พรรณนานิคม", "อ.พังโคน", "อ.โพนนาแก้ว", "อ.ภูพาน", "อ.เมืองสกลนคร", "อ.วานรนิวาส", "อ.วาริชภูมิ", "อ.สว่างแดนดิน", "อ.ส่องดาว", "อ.อากาศอำนวย"}
Songkhla = {"อ.กระแสสินธุ์", "อ.คลองหอยโข่ง", "อ.ควนเนียง", "อ.จะนะ", "อ.เทพา", "อ.นาทวี", "อ.นาหม่อม", "อ.บางกล่ำ", "อ.เมืองสงขลา", "อ.ระโนด", "อ.รัตภูมิ", "อ.สทิงพระ", "อ.สะเดา", "อ.สะบ้าย้อย", "อ.สิงหนคร", "อ.หาดใหญ่"}
Satun = {"อ.ควนกาหลง", "อ.ควนโดน", "อ.ท่าแพ", "อ.ทุ่งหว้า", "อ.มะนัง", "อ.เมืองสตูล", "อ.ละงู"}
Samut_Prakan = {"อ.บางบ่อ", "อ.บางพลี", "อ.บางเสาธง", "อ.พระประแดง", "อ.พระสมุทรเจดีย์", "อ.เมืองสมุทรปราการ"}
Samut_Songkhram = {"อ.บางคนที", "อ.เมืองสมุทรสงคราม", "อ.อัมพวา"}
Samut_Sakhon = {"อ.กระทุ่มแบน", "อ.บ้านแพ้ว", "อ.เมืองสมุทรสาคร"}
Sa_Kaeo = {"อ.เขาฉกรรจ์", "อ.คลองหาด", "อ.โคกสูง", "อ.ตาพระยา", "อ.เมืองสระแก้ว", "อ.วังน้ำเย็น", "อ.วังสมบูรณ์", "อ.วัฒนานคร", "อ.อรัญประเทศ"}
Saraburi = {"อ.แก่งคอย", "อ.เฉลิมพระเกียรติ", "อ.ดอนพุด", "อ.บ้านหมอ", "อ.พระพุทธบาท", "อ.มวกเหล็ก", "อ.เมืองสระบุรี", "อ.วังม่วง", "อ.วิหารแดง", "อ.เสาไห้", "อ.หนองแค", "อ.หนองแซง", "อ.หนองโดน"}
Sing_Buri = {"อ.ค่ายบางระจัน", "อ.ท่าช้าง", "อ.บางระจัน", "อ.พรหมบุรี", "อ.เมืองสิงห์บุรี", "อ.อินทร์บุรี"}
Sukhothai = {"อ.กงไกรลาศ", "อ.คีรีมาศ", "อ.ทุ่งเสลี่ยม", "อ.บ้านด่านลานหอย", "อ.เมืองสุโขทัย", "อ.ศรีนคร", "อ.ศรีสัชนาลัย", "อ.ศรีสำโรง", "อ.สวรรคโลก"}
Suphan_Buri = {"อ.ดอนเจดีย์", "อ.ด่านช้าง", "อ.เดิมบางนางบวช", "อ.บางปลาม้า", "อ.เมืองสุพรรณบุรี", "อ.ศรีประจันต์", "อ.สองพี่น้อง", "อ.สามชุก", "อ.หนองหญ้าไซ", "อ.อู่ทอง"}
Surat_Thani = {"อ.กาญจนดิษฐ์", "อ.เกาะพะงัน", "อ.เกาะสมุย", "อ.คีรีรัฐนิคม", "อ.เคียนซา", "อ.ชัยบุรี", "อ.ไชยา", "อ.ดอนสัก", "อ.ท่าฉาง", "อ.ท่าชนะ", "อ.บ้านตาขุน", "อ.บ้านนาเดิม", "อ.บ้านนาสาร", "อ.พนม", "อ.พระแสง", "อ.พุนพิน", "อ.เมืองสุราษฎร์ธานี", "อ.วิภาวดี", "อ.เวียงสระ"}
Surin = {"อ.กาบเชิง", "อ.เขวาสินรินทร์", "อ.จอมพระ", "อ.ชุมพลบุรี", "อ.ท่าตูม", "อ.โนนนารายณ์", "อ.บัวเชด", "อ.ปราสาท", "อ.พนมดงรัก", "อ.เมืองสุรินทร์", "อ.รัตนบุรี", "อ.ลำดวน", "อ.ศรีณรงค์", "อ.ศีขรภูมิ", "อ.สนม", "อ.สังขะ", "อ.สำโรงทาบ"}
Nong_Khai = {"อ.ท่าบ่อ", "อ.เฝ้าไร่", "อ.โพธิ์ตาก", "อ.โพนพิสัย", "อ.เมืองหนองคาย", "อ.รัตนวาปี", "อ.ศรีเชียงใหม่", "อ.สระใคร", "อ.สังคม"}
Nong_Bua_Lamphu = {"อ.นากลาง", "อ.นาวัง", "อ.โนนสัง", "อ.เมืองหนองบัวลำภู", "อ.ศรีบุญเรือง", "อ.สุวรรณคูหา"}
Ang_Thong = {"อ.ไชโย", "อ.ป่าโมก", "อ.โพธิ์ทอง", "อ.เมืองอ่างทอง", "อ.วิเศษชัยชาญ", "อ.สามโก้", "อ.แสวงหา"}
Amnat_Charoen = {"อ.ชานุมาน", "อ.ปทุมราชวงศา", "อ.พนา", "อ.เมืองอำนาจเจริญ", "อ.ลืออำนาจ", "อ.เสนางคนิคม", "อ.หัวตะพาน"}
Udon_Thani = {"อ.กุดจับ", "อ.กุมภวาปี", "อ.กู่แก้ว", "อ.ไชยวาน", "อ.ทุ่งฝน", "อ.นายูง", "อ.น้ำโสม", "อ.โนนสะอาด", "อ.บ้านดุง", "อ.บ้านผือ", "อ.ประจักษ์ศิลปาคม", "อ.พิบูลย์รักษ์", "อ.เพ็ญ", "อ.เมืองอุดรธานี", "อ.วังสามหมอ", "อ.ศรีธาตุ", "อ.สร้างคอม", "อ.หนองวัวซอ", "อ.หนองแสง", "อ.หนองหาน"}
Uttaradit = {"อ.ตรอน", "อ.ทองแสนขัน", "อ.ท่าปลา", "อ.น้ำปาด", "อ.บ้านโคก", "อ.พิชัย", "อ.ฟากท่า", "อ.เมืองอุตรดิตถ์", "อ.ลับแล"}
Uthai_Thani = {"อ.ทัพทัน", "อ.บ้านไร่", "อ.เมืองอุทัยธานี", "อ.ลานสัก", "อ.สว่างอารมณ์", "อ.หนองขาหย่าง", "อ.หนองฉาง", "อ.ห้วยคต"}
Ubon_Ratchathani = {"อ.กุดข้าวปุ้น", "อ.เขมราฐ", "อ.เขื่องใน", "อ.โขงเจียม", "อ.ดอนมดแดง", "อ.เดชอุดม", "อ.ตระการพืชผล", "อ.ตาลสุม", "อ.ทุ่งศรีอุดม", "อ.นาจะหลวย", "อ.นาตาล", "อ.นาเยีย", "อ.น้ำขุ่น", "อ.น้ำยืน", "อ.บุณฑริก", "อ.พิบูลมังสาหาร", "อ.โพธิ์ไทร", "อ.ม่วงสามสิบ", "อ.เมืองอุบลราชธานี", "อ.วารินชำราบ", "อ.ศรีเมืองใหม่", "อ.สว่างวีระวงศ์", "อ.สำโรง", "อ.สิรินธร", "อ.เหล่าเสือโก้ก"}



bad_char = ['+','-','*','/','@','#']
pattern = '(ผู้ติดเชื้อ|ผู้ป่วย)(.*?)(ราย|คน)'
pattern2 = '\d+'



df = pd.DataFrame(columns= ['created_at','ผู้ป่วยคาดการณ์','Province'] )

for i in data:
    print(i['text'])
    if i['place'] is not None:
        created_at = i['created_at']
        #place = i['place']
        Province = i['place']['name']
        
        value = i['text']
        print(value)
        for i in bad_char:#clean bad char
	        value = value.replace(i,'')
        values = re.search(pattern,value)#ใช้ reg clean จาก text
        print(values)
        if values is not None:#เช็ค null
            print(values.group(2))
            values1 = re.findall(pattern2,values.group(2))
            print(values1)
            numbe = 0
            for x in values1[-1]:
                if x == "1" :
                    numbe = x
                    print(numbe)
                elif x == "2":
                    numbe = x
                    print(numbe)
                elif values == "":
                    numbe = 0
            Province = trnsProvince(Province)
            new_column = pd.Series([created_at,numbe,Province], index=df.columns)
            df = df.append(new_column,ignore_index=True)
print(df)
#df.to_json('tweeterClean.json')
df.to_excel('tweeterClean.xlsx')


